<a href="https://colab.research.google.com/github/12345997/projecto/blob/main/Copy_of_Python_Data_Cleaning_Basics.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<font color="green">*To start working on this notebook, or any other notebook that we will use in the Moringa Data Science Course, we will need to save our own copy of it. We can do this by clicking File > Save a Copy in Drive. We will then be able to make edits to our own copy of this notebook.*</font>

# Python Data Cleaning: Basics

## Step 1: Finding and counting missing data

Having known how missing values in a dataset are created, we will now get introduced to how we can work with such a dataset. The first step that we will perform is to find the missing values and know how many they are.

In [1]:
# We will first import our dataset that we will use for the examples. We will do this by first
# Importing our pandas library 
import pandas as pd


# then storing the url location of our dataset to the variable url
url = 'http://bit.ly/TitanicDataset1'

# We will read the dataset from above url and store the dataframe in the variable df
df = pd.read_csv(url)
print(df)

      pclass  survived  ...   body                        home.dest
0        1.0       1.0  ...    NaN                     St Louis, MO
1        1.0       1.0  ...    NaN  Montreal, PQ / Chesterville, ON
2        1.0       0.0  ...    NaN  Montreal, PQ / Chesterville, ON
3        1.0       0.0  ...  135.0  Montreal, PQ / Chesterville, ON
4        1.0       0.0  ...    NaN  Montreal, PQ / Chesterville, ON
...      ...       ...  ...    ...                              ...
1305     3.0       0.0  ...    NaN                              NaN
1306     3.0       0.0  ...  304.0                              NaN
1307     3.0       0.0  ...    NaN                              NaN
1308     3.0       0.0  ...    NaN                              NaN
1309     NaN       NaN  ...    NaN                              NaN

[1310 rows x 14 columns]

In [2]:
# Challenge 1
# In parallel to this, we will also be working with another dataset too. We will use it for practice.

# Let's first store our url location just like we did above
gov_dataset = 'http://bit.ly/GovProjectFinanceDataset1'

# Then read the dataset from url and store it in our variable of choice
# 
gov_dataset=pd.read_csv(gov_dataset)

# And familiarize ourselves with the dataframe by viewing its first 5 rows
# 
gov_dataset.head()

                                 Implementing_Agency  ...  OBJECTID
0                                                NaN  ...         0
1   MOEW&NR  National Environment Management Auth...  ...         1
2   Ministry of Agriculture, Livestock and Fisheries  ...         2
3                                     The Presidency  ...         3
4   MOAL&F  Kenya  Plant Health Inspectorate Serv...  ...         4

[5 rows x 7 columns]

In [3]:
# We count the number of non - missing values in the df dataframe
#
df.count()

pclass       1309
survived     1309
name         1309
sex          1309
age          1046
sibsp        1309
parch        1309
ticket       1309
fare         1308
cabin         295
embarked     1307
boat          486
body          121
home.dest     745
dtype: int64

In [4]:
# Challenge 2: Government Project Dataset
# We also count the number of non - missing values in the our government project dataset
# 
gov_dataset.count()

Implementing_Agency                      39
Total_-_GOK_Budget_Est_KES               39
Total_-_Loan_Budget_Est_KES              40
Total_-_Grant_Budget_Est_KES             40
Total_Budget_Supported__by_Donors_KES    40
Total_2013/2014_Budget_KES               40
OBJECTID                                 40
dtype: int64

In [5]:
len(gov_dataset)

40

In [6]:
# A longer method can be to subtract the no. of non-missing rows from the total number 
# of rows in the dataframe in order to determine the no. of missing values as shown
# 
num_rows = df.shape[0]
num_missing = num_rows - df.count() 
num_missing

pclass          1
survived        1
name            1
sex             1
age           264
sibsp           1
parch           1
ticket          1
fare            2
cabin        1015
embarked        3
boat          824
body         1189
home.dest     565
dtype: int64

In [7]:
# Challenge 3: Government Project Dataset
# We now also subtract the no. of non-missing rows from the total number of rows 
# to determine the no. of missing values in our government project dataset
#
numrows=len(gov_dataset)
nummissing=numrows-gov_dataset.count()
nummissing

Implementing_Agency                      1
Total_-_GOK_Budget_Est_KES               1
Total_-_Loan_Budget_Est_KES              0
Total_-_Grant_Budget_Est_KES             0
Total_Budget_Supported__by_Donors_KES    0
Total_2013/2014_Budget_KES               0
OBJECTID                                 0
dtype: int64

In [8]:
# Another method would also be to count the number of missing values in our dataframe,  
# using the count_nonzero function from numpy - and including the isnull() method.

# But before we do that, we would need import numpy,
# 
import numpy as np


# Then count those missing values in our dataframe
#
np.count_nonzero(df.isnull())

3869

In [9]:
# Challenge 4: Government Project Dataset
# Let's just do what we did in our previous cell. We found out the number of missing values 
# in our dataset using the count_nonzero function from numpy 
#
import numpy as np
np.count_nonzero(gov_dataset.isnull())

2

In [10]:
# We could also count the number of missing values for a particular column by specifying 
# the column by still using the count_nonzero function from numpy 
# 
np.count_nonzero(df['body'].isnull())

1189

In [ ]:
# Challenge 5: Government Project Dataset
# And again specify how many non-missing values we have in the column: Total_-_GOK_Budget_Est_KES	
#
print(gov_dataset['Total_-_GOK_Budget_Est_KES'].isnull())

## Step 2: Clean Missing Data

Now that we have been able to identify our missing values in our datasets, we can deal with them in the following ways.

### a) We can recode/replace these values
Here, we can do this by using the fillna method and recoding/replacing the missing values with another value or other values. In this example, we will recode the missing values to 0.

In [26]:
# We can recode missing values with 0 by doing the following. 
# Do note that this will appear as 0.0 in your dataframe.
# 
df_recode = df.fillna(0)

# then preview the first 5 rows for the recoded dataframe
#
df_recode.head(5)

   pclass  survived  ...   body                        home.dest
0     1.0       1.0  ...    0.0                     St Louis, MO
1     1.0       1.0  ...    0.0  Montreal, PQ / Chesterville, ON
2     1.0       0.0  ...    0.0  Montreal, PQ / Chesterville, ON
3     1.0       0.0  ...  135.0  Montreal, PQ / Chesterville, ON
4     1.0       0.0  ...    0.0  Montreal, PQ / Chesterville, ON

[5 rows x 14 columns]

In [17]:
# After recoding, let's check for non-missing values in the recoded dataframe
#
df_recode.count()

pclass       1310
survived     1310
name         1310
sex          1310
age          1310
sibsp        1310
parch        1310
ticket       1310
fare         1310
cabin        1310
embarked     1310
boat         1310
body         1310
home.dest    1310
dtype: int64

In [25]:
# Challenge 6: Government Project Dataset
# Nice! Let's now replace the missing values in our dataset with 0 again 
# just as in our previous example
# 
Governmentproject=gov_dataset.fillna(0)
Governmentproject.head(5)

                                 Implementing_Agency  ...  OBJECTID
0                                                  0  ...         0
1   MOEW&NR  National Environment Management Auth...  ...         1
2   Ministry of Agriculture, Livestock and Fisheries  ...         2
3                                     The Presidency  ...         3
4   MOAL&F  Kenya  Plant Health Inspectorate Serv...  ...         4

[5 rows x 7 columns]

In [20]:
Governmentproject.count()

Implementing_Agency                      40
Total_-_GOK_Budget_Est_KES               40
Total_-_Loan_Budget_Est_KES              40
Total_-_Grant_Budget_Est_KES             40
Total_Budget_Supported__by_Donors_KES    40
Total_2013/2014_Budget_KES               40
OBJECTID                                 40
dtype: int64

**Challenge 7:** Together with your peer now discuss the cases where you might use the above recoding technique.

### b) We can fill forward missing values

When data is filled data forward, the last known value is used for the next missing value. The missing values are replaced with the last known/recorded value. Let's see how that works.

In [21]:
# First lets preview out df ,and note the missing data in the boat and body columns
#
df.head()

   pclass  survived  ...   body                        home.dest
0     1.0       1.0  ...    NaN                     St Louis, MO
1     1.0       1.0  ...    NaN  Montreal, PQ / Chesterville, ON
2     1.0       0.0  ...    NaN  Montreal, PQ / Chesterville, ON
3     1.0       0.0  ...  135.0  Montreal, PQ / Chesterville, ON
4     1.0       0.0  ...    NaN  Montreal, PQ / Chesterville, ON

[5 rows x 14 columns]

In [22]:
df.count()

pclass       1309
survived     1309
name         1309
sex          1309
age          1046
sibsp        1309
parch        1309
ticket       1309
fare         1308
cabin         295
embarked     1307
boat          486
body          121
home.dest     745
dtype: int64

In [ ]:
# And now let's fill forward
#
df_fill_forward = df.fillna(method='ffill')

# Then preview our dataframe and try to understand it
#
df_fill_forward.head()
 

# Did you notice what happens when the column begins with a missing value? 
# Discuss this with your peer

In [ ]:
df_fill_forward.count()

In [28]:
# Challenge 8: Government Project Dataset
# Onto our other dataset, let's now fill forward the missing values and see what happens
# 
government_fillfoward=gov_dataset.fillna(method="ffill")
government_fillfoward.head()

                                 Implementing_Agency  ...  OBJECTID
0                                                NaN  ...         0
1   MOEW&NR  National Environment Management Auth...  ...         1
2   Ministry of Agriculture, Livestock and Fisheries  ...         2
3                                     The Presidency  ...         3
4   MOAL&F  Kenya  Plant Health Inspectorate Serv...  ...         4

[5 rows x 7 columns]

In [ ]:
government_fillfoward.count()

**Challenge 9: **Together with your peer discuss the cases where you might use the above fill forward technique.

### c) We can fill backward missing values

We can also do the opposite, and fill data backward our missing values. When doing this, the newest value replaces the missing data.

In [ ]:
# Again first lets preview df (last 10 items), and note the missing data in the boat and body columns
#
print(df.tail(10))

In [31]:
# And now fill backward
#
df_fill_backward = df.fillna(method='bfill')

# Then preview our dataframe (last 10 items) and try to understand what took place
#
print(df_fill_backward.tail(10))

# After this, we will discuss what happens when a column ends with a missing value.

      pclass  survived  ...   body home.dest
1300     3.0       1.0  ...  312.0       NaN
1301     3.0       0.0  ...  312.0       NaN
1302     3.0       0.0  ...  328.0       NaN
1303     3.0       0.0  ...  328.0       NaN
1304     3.0       0.0  ...  328.0       NaN
1305     3.0       0.0  ...  304.0       NaN
1306     3.0       0.0  ...  304.0       NaN
1307     3.0       0.0  ...    NaN       NaN
1308     3.0       0.0  ...    NaN       NaN
1309     NaN       NaN  ...    NaN       NaN

[10 rows x 14 columns]

In [32]:
# Challenge 10: Government Project Dataset
# Back to our government dataset. We now fill backward the missing values 
# and try to understand the changes that took place
# 
government_fillbackward=gov_dataset.fillna(method="bfill")
government_fillbackward

                                  Implementing_Agency  ...  OBJECTID
0    MOEW&NR  National Environment Management Auth...  ...         0
1    MOEW&NR  National Environment Management Auth...  ...         1
2    Ministry of Agriculture, Livestock and Fisheries  ...         2
3                                      The Presidency  ...         3
4    MOAL&F  Kenya  Plant Health Inspectorate Serv...  ...         4
5                         Ministry of Foreign Affairs  ...         5
6      MRDA  Ewaso Ngiro North Dev. Authority (ENNDA)  ...         6
7    MOE&P  Kenya Electricity Transmission Company...  ...         7
8    Office of The Attorney General and Department...  ...         8
9                  State Department of Infrastructure  ...         9
10                                 Ministry of Health  ...        10
11   MOES&T  Kimathi University of Science and Tec...  ...        11
12                Ministry of Devolution and Planning  ...        12
13   Ministry of Information and Communications an...  ...        13
14    Ministry of Labour Social Security and Services  ...        14
15   Ministry of Commerce Tourism and East African...  ...        15
16   Ministry of Industialization and Enterprise D...  ...        16
17      MRDA Ewaso Ngiro North Dev. Authority (ENNDA)  ...        17
18           Ministry of Transport and Infrastructure  ...        18
19                Ministry of Sports Culture and Arts  ...        19
20                              Ministry of Education  ...        20
21                Kisiwa Technical Training Institute  ...        21
22                    MOES&T  Embu University College  ...        22
23           MOES&T  South Eastern University College  ...        23
24                              The National Treasury  ...        24
25                           MOES&T  Kisii University  ...        25
26              MOR  Kenya National Highway Authority  ...        26
27                Ministry of Devolution and Planning  ...        27
28                                     The Presidency  ...        28
29   Ministry of Environment Water and Natural Res...  ...        29
30                                      The Judiciary  ...        30
31     Ministry of Land Housing and Urban Development  ...        31
32    Independent Electoral and Boundaries Commission  ...        32
33   Ministry of Interior and Coordination of Nati...  ...        33
34                    MOES&T  Egerton University (EU)  ...        34
35   MOE&P  Kenya Electricity Generating Company L...  ...        35
36                     State Department for Education  ...        36
37                     Ministry of Energy & Petroleum  ...        37
38                MOES&T  Karatina University College  ...        38
39            MOR  Kenya Rural Roads Authority (KERA)  ...        39

[40 rows x 7 columns]

**Challenge 11: ** Together with your peer discuss the cases where you might use the above fill backward technique.


### d) We can interpolate missing values

Interpolation uses other values to fill in the missing values. It does this by treating missing values as if they should be equally spaced apart. This function fills in the missing values linearly as shown in the example below.

In [33]:
# Once again first lets print out df, and note the missing data in the boat and body columns
# NB: iloc gets rows (or columns) at particular positions in the index
#
df.iloc[0:10, 11:13].head(10)

  boat   body
0    2    NaN
1   11    NaN
2  NaN    NaN
3  NaN  135.0
4  NaN    NaN
5    3    NaN
6   10    NaN
7  NaN    NaN
8    D    NaN
9  NaN   22.0

In [39]:
# Then perform our intepolation
#
df_interpolate = df.interpolate().iloc[0:10, 11:13];
df_interpolate.head(10)

  boat        body
0    2         NaN
1   11         NaN
2  NaN         NaN
3  NaN  135.000000
4  NaN  116.166667
5    3   97.333333
6   10   78.500000
7  NaN   59.666667
8    D   40.833333
9  NaN   22.000000

In [ ]:
gov_dataset.head(20)

In [36]:
# Challenge 12: Government Project Dataset
# Intepolate the missing values in our dataset, noting the changes
#
gov_interpolate=gov_dataset.interpolate().iloc[0:10, 11:13];
gov_interpolate

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

**Challenge 13: **Together with your peer discuss the cases where you might use the above interpolate technique.

### e) We can drop/delete missing values

The other way to work with missing data is to drop/delete the records with the missing data. This is a judgement that you have to make based on your research. Sometimes keeping the entire dataset together with the missing values, can leave you with a useless dataset. On the other hand, the missing data many not be random and dropping those missing values would leave you with a biased dataset or deleting the missing dataset might leave you with insufficient data for analysis. All of this we will learn more indepth during the course of the program. 

For now lets see how we can drop missing values from a dataset.

In [40]:
# Let's find out the size of our dataset
# 
df.shape

(1310, 14)

In [44]:
# If we were to keep our complete rows; meaning we drop any record with a missing value, then
#
df_dropped = df.dropna()
df_dropped
# We are left with no rows of data
#
df_dropped.shape

(0, 14)

In [ ]:
# Printing out df_dropped
df_dropped

In [ ]:
# Challenge 14: Financial Allocation Dataset
# Let's now drop the records that have missing values
# url = http://bit.ly/MSFinancialDataset
#
url = "http://bit.ly/MSFinancialDataset"
url_df=pd.read_csv(url)
url_df

In [ ]:
#count non missing values
url_df.count

In [52]:
url_df.shape

(26, 18)

In [ ]:
url_df_dropping=url_df.dropna()
url_df_dropping

In [54]:
url_df_dropping.shape

(16, 18)

Challenge 15: Together with your peer discuss the cases where you might use the above drop/delete technique.